In [1]:
import pandas as pd

In [2]:
cols = [
    "CO_CURSO",
    "TP_NIVEL_ACADEMICO",
    "TP_COR_RACA",
    "TP_SEXO",
    "NU_ANO_NASCIMENTO"
]

In [4]:
curso = pd.read_csv('SUP_ALUNO_2019.CSV', sep='|', encoding="latin1", usecols=cols )

In [5]:
curso.head()

   CO_CURSO  TP_NIVEL_ACADEMICO  TP_COR_RACA  TP_SEXO  NU_ANO_NASCIMENTO
0         1                   1            2        1               1992
1         1                   1            3        2               1987
2         1                   1            3        2               1988
3         1                   1            2        1               1988
4         1                   1            3        2               1977